{
  "region":[
    {
      "name":"Kalos",
      "description":"Kalos is the region where the storyline of the Pokémon X and Y games takes place.",
      "story":"3,000 years before, during the Great Kalos War, many Pokémon had to go to the front in the battle, including the Floette d'A.Z.(the King of Kalos). Unfortunately, his Pokémon died, driving him crazy, then built a huge machine that could revive his Pokémon and offering it eternal life. Afterwards, A.Z. wanted to revenge, he turned his machine into a weapon of destruction: the ultimate weapon. This put an end to the great war and cost the lives of many Pokémon. A.Z. had become a true god of destruction for Floette, and it abandoned him until this man changed. Since then, the King of Kalos has been wandering the world in the hope of finding Floette.",
      "image":"https://zupimages.net/up/20/18/d9d5.png"
    },
    {
      "name":"Unova",
      "description":"Unys is the region of the Pokémon Black and White and Pokémon Black 2 and White 2 games. Unys is based in the Greater New York area of the United States.",
      "story":"In mythology, Unova was created by uniting the warring peoples by twin heroes. They used a single dragon for more than 2,500 years. The brothers began to quarrel over their beliefs, the firstborn sought truth and the younger brother ideals.  Their disputes divided the single dragon in Reshiram, who sided with the older, and Zekrom, who sided with the younger. Since they were both born of the same dragon, neither of them could defeat the other, and the brothers declared that there was no good side. However, their sons continued the fight and the two dragons began to fight again, destroying Unova region before disappearing.",
      "image":"https://zupimages.net/up/20/18/jixb.png"
    },
    {
      "name":"Sinnoh",
      "description":"Sinnoh is a region of the Pokémon World that appears in the Pokémon Diamond, Pearl and Platinum games. This region is located north of the Kanto, Johto and Hoenn regions.",
      "story":"According to several myths, Sinnoh was the first to be created. In the depths of oblivion, an egg appears and hatches into Arceus, the first Pokémon to exist. Arceus is the first to create Dialga and Palkia, giving them the ability to control Time and Space, respectively. At the same time Giratina was born but was banished to another dimension because of its violence. In the creation of the world, Arceus created Azelf, Uxie and Mesprit, symbolizing willpower, knowledge and emotion respectively, to transmit them to humans and Pokémon.",
      "image":"https://zupimages.net/up/20/18/nuct.png"
    },
    {
      "name":"Johto",
      "description":"Johto is one of the regions of the Pokémon world that appears in the Pokémon Gold, Silver and Crystal and Pokémon HeartGold and SoulSilver games.",
      "story":"In Johto lies traditional landscapes, myths and vestiges of the past, in which we find places of worship such as the copper tower and the scrap metal tower, built 700 years ago and intended to house the legendary Pokémon Lugia and Ho-Oh. Johto could be the cradle of a civilization that for many years has developed thanks to human beings. There is only one large city in the area, which is probably due to the fact that Johto preserves its history and remains and the people who live there prefer to maintain their traditional lifestyle.",
      "image":"https://zupimages.net/up/20/18/sopj.png"
    },
    {
      "name":"Hoenn",
      "description":"Hoenn is a region of the Pokémon world that appears in the Pokémon Ruby, Sapphire and Emerald games and their remakes, Pokémon Omega Ruby and Alpha Sapphire. It is located southwest of Johto and Kanto.",
      "story":"According to legend, the Hoenn was the creation of the legendary Pokémon Groudon and Kyogre. Groudon created the land and mountains, and Kyogre created the oceans and rivers. But both wanted to see the world in their own image. A terrible war took place, which was only ended by the intervention of Zigzagoon, a protective Pokémon venerated by the Hoenn people, who calmed both Pokémon. Then Primal Reversion appeared and the two began again a war, threatening the people and the Pokémon of Hoenn. After their prayers, Zigzagoon came down from sky. The fight lasted 20 days and 20 nights ...",
      "image":"https://zupimages.net/up/20/18/v2v2.png"
    },
    {
      "name":"Kanto",
      "description":"Kanto is the first revealed region of the Pokémon world to appear in the Red, Blue and Yellow Pokémon games.",
      "story":"Kanto is an industrialized and urbanized region. There are no signs of human presence there that are ancient enough to imagine that the area could have been inhabited for a long time. The region of Kanto, which was to be a new territory for Johto, then became deeply differentiated in terms of its way of life. In Kanto there are no mythical stories or constructions associated with a legendary Pokémon. The most emblematic Pokémon in the region remains Mewtwo, a human creation.",
      "image":"https://zupimages.net/up/20/18/zz4m.png"
    },
    {
      "name":"Alola",
      "description":"Alola is the region where the story of Pokémon Sun and Moon and Pokémon Ultra-Sun and Ultra-Moon takes place. This region is based on the Hawaiian archipelago.",
      "story":"According to the legends of Alola, the Guardian deities serve as protectors of the island each resides in. At one point, they participated in war against each other, due to the destruction the war brought, they stopped being involved in human affairs. Whenever an Ultra Beast appears in Alola, the deities will fiercely fight against it in order to protect their islands from invaders. A Solgaleo/Lunala defeated them easily. As a reward, Tapunium Z was bestowed upon them. The Solgaleo/Lunala then created many Cosmog for the Guardian deities to protect and watch over until they fully evolved and returned to Ultra Space.",
      "image":"https://zupimages.net/up/20/18/phv5.png"
    },
    {
      "name":"Galar",
      "description":"Galar is the region where the plot of the Pokémon Sword and Shield games takes place. Galar has three important cities: Motorby, Kickenham and the larger Winscor.",
      "story":"",
      "image":"https://zupimages.net/up/20/18/4auf.png"
    }
  ],
  "pokemon":[
    {"id":"0",
      "name":"Staters Pokémon : Chespin Quilladin Chesnaught / Froakie Frogadier Greninja / Fennekin Braixen Delphox",
      "image":""
    },
    {
      "id":"1",
      "name":"Fletchling Fletchinder Talonflame",
      "image":""
    },
    {
      "id":"2",
      "name":"Scatterbug Spewpa Vivillon",
      "image":""
    },
    {
      "id":"3",
      "name":"Pansage Pansear Panpour",
      "image":""
    },
    {
      "id":"4",
      "name":"Pichu Pikachu Raichu",
      "image":""
    },
    {
      "id":"5",
      "name":"Magikarp Gyarados Mega Gyarados",
      "image":""
    },
    {
      "id":"6",
      "name":"Litleo Pyroar",
      "image":""
    },
    {
      "id":"7",
      "name":"Riolu Lucario",
      "image":""
    },
    {
      "id":"8",
      "name":"Flabébé Floette Florges",
      "image":""
    },
    {
      "id":"9",
      "name":"Scraggy Scrafy",
      "image":""
    },
    {
      "id":"10",
      "name":"Espurr Meowstic",
      "image":""
    },
    {
      "id":"11",
      "name":"Honedge Aegislash",
      "image":""
    },
    {
      "id":"12",
      "name":"Ducklett Swanna",
      "image":""
    },
    {
      "id":"13",
      "name":"Axew Fraxure Haxorus",
      "image":""
    },
    {
      "id":"14",
      "name":"Goomy Sliggoo Goodra",
      "image":""
    },
    {
      "id":"15",
      "name":"Karrablast Escavalier / Shelmet Accelgor",
      "image":""
    },
    {
      "id":"16",
      "name":"Gastly Haunter Gengar",
      "image":""
    },
    {
      "id":"17",
      "name":"Foongus Amoonguss",
      "image":""
    },
    {
      "id":"18",
      "name":"Phantump Trevenant / Pumpkaboo Gourgeist",
      "image":""
    },
    {
      "id":"19",
      "name":"Trubbish Garbodor",
      "image":""
    },
    {
      "id":"20",
      "name":"Cubchoo Beartic",
      "image":""
    },
    {
      "id":"21",
      "name":"Timburr Gurdurr Conkeldurr",
      "image":""
    },
    {
      "id":"22",
      "name":"Noibat Noivern",
      "image":""
    },
    {
      "id":"23",
      "name":"Deino Zweilous Hydreigon",
      "image":""
    },
    {
      "id":"24",
      "name":"Mienfoo Mienshao",
      "image":""
    },
    {
      "id":"25",
      "name":"Absol",
      "image":""
    },
    {
      "id":"26",
      "name":"sepiatop sepiatroce",
      "image":""
    },
    {
      "id":"27",
      "name":"Wailmer Wailord",
      "image":""
    },
    {
      "id":"28",
      "name":"Skrelp Dragalge",
      "image":""
    },
    {
      "id":"29",
      "name":"Woobat Swoobat",
      "image":""
    },
    {
      "id":"30",
      "name":"Tyrunt Tyrantrum / Amaura Aurorus",
      "image":""
    },
   {
      "id":"31",
      "name":"Solosis Duosion Reuniclus",
      "image":""
    },
    {
      "id":"999",
      "name":"Xerneas VS Yveltal",
      "image":""
    }
  ]
}
