{
  "region":[
    {
      "name":"Kanto",
      "description":"Kanto is the first revealed region of the Pokémon world to appear in the Red, Blue and Yellow Pokémon games.",
      "story":"Kanto is an industrialized and urbanized region. There are no signs of human presence there that are ancient enough to imagine that the area could have been inhabited for a long time. The region of Kanto, which was to be a new territory for Johto, then became deeply differentiated in terms of its way of life. In Kanto there are no mythical stories or constructions associated with a legendary Pokémon. The most emblematic Pokémon in the region remains Mewtwo, a human creation.",
      "image":"https://zupimages.net/up/20/18/zz4m.png",
      "country":"Kanto, inspired by the Kantō (関東, meaning ''east of the barrier'')region of Japan.",
      "legendary_primary":"The Genetic Pokémon:\nMewtwo is the result of genetic manipulations carried out on Mew's DNA in order to turn him into an extremely ferocious creature. Totally designed for combat, it has not been endowed with a sensitive heart and therefore only thinks about fighting.",
      "primary_pic":"",
      "legendary_secondary":"The legendary bird trio:\nReferences to the gods Odin, Thor and Râ respectively (in French), Artikodin, Electhor and Sulfura are important for the meteorological stability of the continent. Failure of any one of these Pokémon could result in a disruption of the weather.",
      "secondary_pic":"",
      "legendary_fabulous":"Mew:\nThe legend states that its DNA contains the genetic code of all Pokémon, and some scientists even see it as their common ancestor, partly because it is capable of mastering most of the Pokémon's abilities.",
      "fabulous_pic":""
    },
    {
      "name":"Johto",
      "description":"Johto is one of the regions of the Pokémon world that appears in the Pokémon Gold, Silver and Crystal and Pokémon HeartGold and SoulSilver games.",
      "story":"In Johto lies traditional landscapes, myths and vestiges of the past, in which we find places of worship such as the copper tower and the scrap metal tower, built 700 years ago and intended to house the legendary Pokémon Lugia and Ho-Oh. Johto could be the cradle of a civilization that for many years has developed thanks to human beings. There is only one large city in the area, which is probably due to the fact that Johto preserves its history and remains and the people who live there prefer to maintain their traditional lifestyle.",
      "image":"https://zupimages.net/up/20/18/sopj.png",
      "country":"Johto, inspired by Kansai in Japan, and the Western part of Shikoku.",
      "legendary_primary":"The Guardians of the seas and the heavens:\nBoth once resided on Rosalia's two towers in Johto, the Copper Tower and the Carillon Tower, respectively, but they fled when a fire destroyed the Copper Tower. Since then, one has been sleeping at the bottom of the oceans while the other has been tirelessly roaming the skies. Each of them is the master of a legendary trio: Lugia dominates the birds of Kanto while Ho-Oh is linked to the legendary beasts of Kanto.",
      "primary_pic":"",
      "legendary_secondary":"The legendary trio of beasts:\nResurrected by Ho-Oh, he gave them immense powers. These three Pokémon represented, respectively, lightning, fire and heavy rain. Rejected by the inhabitants, the three Pokémon then set out to roam the Johto region.",
      "secondary_pic":"",
      "legendary_fabulous":"Celebi:\nAble to travel through time, it exists at the same time in several eras. It comes from the future and appears only in times of peace, that's why its arrival announces a good and pleasant future. The vegetation of the forests where he settles becomes particularly lush, which earned him the nickname of ''guardian of the forests''.",
      "fabulous_pic":""
    },
    {
      "name":"Hoenn",
      "description":"Hoenn is a region of the Pokémon world that appears in the Pokémon Ruby, Sapphire and Emerald games and their remakes, Pokémon Omega Ruby and Alpha Sapphire.",
      "story":"According to legend, the Hoenn was the creation of the legendary Pokémon Groudon and Kyogre. Groudon created the land and mountains, and Kyogre created the oceans and rivers. But both wanted to see the world in their own image. A terrible war took place, which was only ended by the intervention of Zigzagoon, a protective Pokémon venerated by the Hoenn people, who calmed both Pokémon. Then Primal Reversion appeared and the two began again a war, threatening the people and the Pokémon of Hoenn. After their prayers, Zigzagoon came down from sky. The fight lasted 20 days and 20 nights ...",
      "image":"https://zupimages.net/up/20/18/v2v2.png",
      "country":"Hoenn, inspired by the Japanese region of Kyushu and part of the archipelago of Okinawa Prefecture.",
      "legendary_primary":"The Weather trio:\nThis trio is composed of Groudon and Kyogre, constantly in conflict, and Rayquaza, the only one able to put an end to their dispute and therefore generally designated as their leader. They also all symbolize a natural element and have a Guardian role. They take turns fighting for power and triggering their anger could have devastating effects on the surrounding climate.",
      "primary_pic":"",
      "legendary_secondary":"The Golems Trio:\nThe Regi (or Golems) trio is composed of Regirock, Registeel and Regice representing respectively a different age: the Stone Age, the Ice Age and the Iron Age. From the fourth generation on, it turns out that a certain Regigigas seems to be composed of the 3 materials that make up their body and would therefore be the leader.\nThe duo Éon:\nThis duo is composed of Latias and Latios. Latias is extremely sensitive to people's emotions and Latios has the power to make a person see an image from his subconscious.",
      "secondary_pic":"",
      "legendary_fabulous":"Jirachi:\nIt would be still in a deep sleep, protected by a thick layer of crystal. It is said that once every 1000 years, he wakes up to grant the wishes written on the papers stuck on his head for a week.\nDexoxys:\nAn extraterrestrial virus, brought to Earth in a meteorite, saw its DNA mutate under the effect of intense radiation, giving birth to Deoxys. This is probably why it appears in regions where polar auroras can be seen.",
      "fabulous_pic":""
    },
    {
      "name":"Sinnoh",
      "description":"Sinnoh is a region of the Pokémon World that appears in the Pokémon Diamond, Pearl and Platinum games. This region is located north of the Kanto, Johto and Hoenn regions.",
      "story":"According to several myths, Sinnoh was the first to be created. In the depths of oblivion, an egg appears and hatches into Arceus, the first Pokémon to exist. Arceus is the first to create Dialga and Palkia, giving them the ability to control Time and Space, respectively. At the same time Giratina was born but was banished to another dimension because of its violence. In the creation of the world, Arceus created Azelf, Uxie and Mesprit, symbolizing willpower, knowledge and emotion respectively, to transmit them to humans and Pokémon.",
      "image":"https://zupimages.net/up/20/18/nuct.png",
      "country":"Sinnoh, inspired by Hokkaido, where the island of Council 4 is inspired by the Kuril Islands and also by the Sakhalin Oblast.",
      "legendary_primary":"The Creation trio:\nThis trio is composed of Dialga (master of time), Palkia (master of space) and Giratina (master of the distortion world). All three were shaped by Arceus, they are also all Dragon type and each has mastery of their own implacable dimension.",
      "primary_pic":"",
      "legendary_secondary":"The guardians of the lakes:\nOften called the three spirits, this trio is composed of Créhelf du Lac Savoir, Créfollet du Lac Vérité and Créfadet du Lac Courage. They represent respectively knowledge, emotion and will. It is said that Arceus would be the creator.\nMaster of the Golems:\nRegigigas is said to have created Pokémon in his own image out of ice, rock and magma, and a persistent legend has it that this Pokémon dragged continents by tying them to ropes.\nThe Lunar Pokémon:\nLooking like a swan, this Pokémon is said to be able to cure diseases caused by Darkrai.",
      "secondary_pic":"",
      "legendary_fabulous":"Manaphy and Phione\nAccording to legend, one day an egg came up from the depths of the ocean after Manaphy hatched. Made from a Manaphy egg, Phione is a unique Pokémon. It lives in the warm tropical seas and will always return to its birthplace, no matter how far away it is, and cannot evolve into Manaphy.\nShaymin:\nIt can instantly purify an area of its polluted air and turn it into a field of flowers and then release the purified air in a violent explosion. Its power varies according to the amount of air sucked in. Shaymin can also communicate telepathically and feel the gratitude of others.\nDarkrai: It only shows up on new moon nights. It can put people and Pokémon to sleep and give them terrible nightmares.\nArceus:\nThe myths of the Sinnoh region tell that Arceus would have emerged from an egg that appeared in nothingness. Arceus would then have shaped the universe with his "1000 arms", starting by giving birth to the duet of Matter: Palkia and Dialga, masters of space and time. He then created the trio of Spirit to link space and time. The legends of the Sinjoh Ruins say that he also created the Pokémon of Antimatter, Giratina, at the same time as the Matter duo.",
      "fabulous_pic":""
    },
    {
      "name":"Unova",
      "description":"Unys is the region of the Pokémon Black and White and Pokémon Black 2 and White 2 games. Unys is based in the Greater New York area of the United States.",
      "story":"In mythology, Unova was created by uniting the warring peoples by twin heroes. They used a single dragon for more than 2,500 years. The brothers began to quarrel over their beliefs, the firstborn sought truth and the younger brother ideals.  Their disputes divided the single dragon in Reshiram, who sided with the older, and Zekrom, who sided with the younger. Since they were both born of the same dragon, neither of them could defeat the other, and the brothers declared that there was no good side. However, their sons continued the fight and the two dragons began to fight again, destroying Unova region before disappearing.",
      "image":"https://zupimages.net/up/20/18/jixb.png",
      "country":"Unys, inspired by the Greater New York area in the United States.",
      "legendary_primary":"The Tao Trio:\nThe trio of Yin (Zekrom), Yang Reshiram) and Qi (Kyurem) is more commonly known as the Tao trio. According to the legend of the region, this trio was created during the war that took place throughout the region.",
      "primary_pic":"",
      "legendary_secondary":"The Blades of Justice:\nThe Musketeers Trio (also called Blades of Justice) is composed of Cobaltium, Terrakium and Viridium. Each of them is inspired by a particular reference respectively: Athos, Porthos and Aramis.\nThe three geniuses:\nAlso called the trio of forces from the nature is composed of Boreas, Fulguris and Demeteros. Each of them is inspired by a particular deity respectively: Fujin, Raijin and Inari.",
      "secondary_pic":"",
      "legendary_fabulous":"Victini:\nFolks say owning Victini can win any fight.\nKeldeo:\nKeldeo often travels all over the world, and most often appears near beautiful rivers. On the top of his head are three feathers: one blue, one orange and one green, representing Cobaltium, Terrakium and Viridium respectively.\nMeloetta:\nAccording to Unys artists, Meloetta's enchanting music and dance has inspired many local works and made this Pokémon popular with musicians and dancers.\nGenesect:\nIt is said that 300 million years ago it was feared as the ultimate predator. It has been modified by Team Plasma and its cannon in its back has been greatly improved.",
      "fabulous_pic":""
    },
    {
      "name":"Kalos",
      "description":"Kalos is the region where the storyline of the Pokémon X and Y games takes place.",
      "story":"3,000 years before, during the Great Kalos War, many Pokémon had to go to the front in the battle, including the Floette d'A.Z.(the King of Kalos). Unfortunately, his Pokémon died, driving him crazy, then built a huge machine that could revive his Pokémon and offering it eternal life. Afterwards, A.Z. wanted to revenge, he turned his machine into a weapon of destruction: the ultimate weapon. This put an end to the great war and cost the lives of many Pokémon. A.Z. had become a true god of destruction for Floette, and it abandoned him until this man changed. Since then, the King of Kalos has been wandering the world in the hope of finding Floette.",
      "image":"https://zupimages.net/up/20/18/d9d5.png",
      "country":"Kalos, inspired by the north of France.",
      "legendary_primary":"The trio of life:\nThis trio, often called the XYZ trio, is composed of Xerneas (Existence), Yveltal (Annihilation) and Zygarde (Balance). They have a close link with the equilibrium of the region.",
      "primary_pic":"",
      "legendary_secondary":"",
      "secondary_pic":"",
      "legendary_fabulous":"Diancie:\nThis Pokémon is a spontaneous mutation of Strassie. Its pink and shiny body is of incomparable beauty and legend has it that it can create a multitude of diamonds. Because of its appearance and extreme rarity, Diancie is the object of fascination for many admirers, who call this Pokémon the ''Pink Princess of Elegance''.\nHoopa:\nThis troublemaker has rings that distort space, and legend has it that he has the ability to teleport things by passing them through his rings.\nVolcanion:\nAccording to legend, it is capable of generating a cloud of steam to hide in. It lives in uninhabited mountains and its steam jet is powerful enough to shave mountains.",
      "fabulous_pic":""
    },
    {
      "name":"Alola",
      "description":"Alola is the region where the story of Pokémon Sun and Moon and Pokémon Ultra-Sun and Ultra-Moon takes place. This region is based on the Hawaiian archipelago.",
      "story":"According to the legends of Alola, the Guardian deities serve as protectors of the island each resides in. At one point, they participated in war against each other, due to the destruction the war brought, they stopped being involved in human affairs. Whenever an Ultra Beast appears in Alola, the deities will fiercely fight against it in order to protect their islands from invaders. A Solgaleo/Lunala defeated them easily. As a reward, Tapunium Z was bestowed upon them. The Solgaleo/Lunala then created many Cosmog for the Guardian deities to protect and watch over until they fully evolved and returned to Ultra Space.",
      "image":"https://zupimages.net/up/20/18/phv5.png",
      "country":"Alola, inspired by the archipelago of Hawaii.",
      "legendary_primary":"The astral trio:\nSometimes called the cosmic trio is composed of Solgaleo (Solar Halo), Lunala (Lunar Halo) and Necrozma (Pokémon Prism). Often added to this trio are the pre-evolutions of Solgaleo and Lunala: Comsog (Pokémon Nebula) and Cosmovum (Pokémon Proto-Star).",
      "primary_pic":"",
      "legendary_secondary":"The Pokémon Multigenome:\nType:0 is a four-legged, chimeric Pokémon with a body made up of a variety of creatures. Like Arceus, its evolutionary evolution can, like Arceus, display and change type using objects.\nThe Guardians of Alola:\nThe Guardian Deities of Alola represent 4 Pokémon protectors of the 4 islands of the Alola region. They are also responsible for choosing the Deans who will govern their respective islands.",
      "secondary_pic":"",
      "legendary_fabulous":"Magearna:\nIt was designed from scratch 500 years ago by a scientist with an unusual genius. He gathered Pokémon's life energy into the spherical object in the centre of his chest, called the Animacœur. Indeed, Magearna has the power to perceive the emotions, thoughts and feelings of humans and Pokémon as he synchronizes with them.\nZeraora:\nZeraora, because of its feline appearance, is inspired by the tiger and the serval. Its Electrik type can refer to Kanehekili, the Hawaiian god of thunder. Its rapid movements and sharp claws are a reference to the kamaitachi.",
      "fabulous_pic":""
    },
    {
      "name":"Galar",
      "description":"Galar is the region where the plot of the Pokémon Sword and Shield games takes place.",
      "story":"",
      "image":"https://zupimages.net/up/20/18/4auf.png",
      "country":"",
      "legendary_primary":"",
      "primary_pic":"",
      "legendary_secondary":"",
      "secondary_pic":"",
      "legendary_fabulous":"",
      "fabulous_pic":""
    }
  ]
}
